### Carregamento

In [1]:
import pandas as pd
# Função para carregar os dados
def carregar_dados(caminho_arquivo, coluna_data=None):
    """
    Carrega um arquivo CSV com dados.
    
    Parâmetros:
    - caminho_arquivo (str): Caminho do arquivo CSV.
    - coluna_data (str, opcional): Nome da coluna de datas para converter para datetime.
    
    Retorna:
    - pandas.DataFrame: DataFrame com os dados carregados.
    """
    # Carrega o CSV com separador ';'
    dados = pd.read_csv(caminho_arquivo, sep=',')
    
    # Converte a coluna de datas para datetime com timezone, se especificada
    if coluna_data:
        dados[coluna_data] = pd.to_datetime(dados[coluna_data], utc=True)
    
    return dados
# Caminho
caminho_arquivo = '../data/raw/sales_data.csv'
# Carrega os dados com o separador correto
dados = carregar_dados(caminho_arquivo)

# Exibir as primeiras linhas do DataFrame
dados.head(10)

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie
5,1021,2023-02-11,Charlie,West,3761.15,32,Food,900.79,1106.51,New,0.21,Cash,Online,West-Charlie
6,1083,2023-04-11,Bob,West,618.31,29,Furniture,2408.81,2624.09,Returning,0.14,Cash,Online,West-Bob
7,1087,2023-01-06,Eve,South,7698.92,46,Furniture,3702.51,3964.65,New,0.12,Bank Transfer,Online,South-Eve
8,1075,2023-06-29,David,South,4223.39,30,Furniture,738.06,1095.45,New,0.05,Bank Transfer,Online,South-David
9,1075,2023-10-09,Charlie,West,8239.58,18,Clothing,2228.35,2682.34,New,0.13,Bank Transfer,Online,West-Charlie

### Tamanho da base

In [2]:
def verificar_tamanho_base(df):
    """
    Verifica o tamanho da base de dados em termos de número de linhas e colunas.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser verificado.
    
    Retorna:
    - dict: Dicionário com o número de linhas e colunas.
    """
    tamanho = {
        'Número de Linhas': df.shape[0],
        'Número de Colunas': df.shape[1]
    }
    
    return tamanho

# Verificar o tamanho da base de dados
tamanho_base = verificar_tamanho_base(dados)
tamanho_base

{'Número de Linhas': 1000, 'Número de Colunas': 14}

### Valores nulos

In [4]:
# Função para verificar valores ausentes
def verificar_valores_ausentes(df):
    """
    Verifica a quantidade e o percentual de valores ausentes em cada coluna de um DataFrame.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser verificado.
    
    Retorna:
    - pandas.DataFrame: DataFrame com a quantidade e o percentual de valores ausentes por coluna.
    """
    # Calcular a quantidade de valores ausentes
    valores_ausentes = df.isnull().sum()
    
    # Calcular o percentual de valores ausentes
    percentual_ausentes = (valores_ausentes / df.shape[0]) * 100
    
    # Criar um DataFrame com os resultados
    tabela_ausentes = pd.DataFrame({
        'Quantidade de Valores Ausentes': valores_ausentes,
        'Percentual de Valores Ausentes (%)': percentual_ausentes
    })
    
    # Ordenar o DataFrame pelo percentual de valores ausentes em ordem decrescente
    tabela_ausentes = tabela_ausentes[tabela_ausentes['Quantidade de Valores Ausentes'] > 0]
    tabela_ausentes = tabela_ausentes.sort_values(by='Percentual de Valores Ausentes (%)', ascending=False)
    
    return tabela_ausentes

# Verificar valores ausentes
tabela_ausentes = verificar_valores_ausentes(dados)
tabela_ausentes

Empty DataFrame
Columns: [Quantidade de Valores Ausentes, Percentual de Valores Ausentes (%)]
Index: []

### Valores duplicados

In [5]:
def verificar_valores_duplicados(df, colunas=None):
    """
    Verifica valores duplicados em um DataFrame, fornecendo análise detalhada.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser analisado
    - colunas (list, opcional): Lista específica de colunas para verificar duplicatas.
                               Se None, verifica todas as colunas.
    
    Retorna:
    - dict: Dicionário com informações sobre duplicatas para cada coluna analisada
    """
    resultado = {}
    
    # Se nenhuma coluna específica for fornecida, usar todas as colunas
    if colunas is None:
        colunas = df.columns
    
    # Análise de duplicatas por coluna
    for coluna in colunas:
        # Encontrar valores duplicados
        duplicados = df[df[coluna].duplicated(keep='first')]
        qtd_duplicados = len(duplicados)
        
        if qtd_duplicados > 0:
            # Contagem de ocorrências de cada valor duplicado
            valores_duplicados = df[coluna].value_counts()[df[coluna].value_counts() > 1]
            
            resultado[coluna] = {
                'possui_duplicados': True,
                'quantidade_duplicados': qtd_duplicados,
                'valores_e_contagem': valores_duplicados.to_dict()
            }
        else:
            resultado[coluna] = {
                'possui_duplicados': False,
                'quantidade_duplicados': 0,
                'valores_e_contagem': {}
            }
    
    # Exibir resumo
    print("=== Análise de Valores Duplicados ===\n")
    
    for coluna, info in resultado.items():
        print(f"\nColuna: {coluna}")
        if info['possui_duplicados']:
            print(f"Status: Possui {info['quantidade_duplicados']} valores duplicados")
            print("Valores duplicados e suas ocorrências:")
            for valor, contagem in info['valores_e_contagem'].items():
                print(f"  - Valor: {valor} | Ocorrências: {contagem}")
        else:
            print("Status: Não possui valores duplicados")
    
    return resultado

# Executar verificação de valores duplicados
resultados_duplicados = verificar_valores_duplicados(dados)

=== Análise de Valores Duplicados ===


Coluna: Product_ID
Status: Possui 900 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 1090 | Ocorrências: 20
  - Valor: 1062 | Ocorrências: 19
  - Valor: 1092 | Ocorrências: 19
  - Valor: 1099 | Ocorrências: 18
  - Valor: 1033 | Ocorrências: 18
  - Valor: 1001 | Ocorrências: 16
  - Valor: 1086 | Ocorrências: 15
  - Valor: 1058 | Ocorrências: 15
  - Valor: 1017 | Ocorrências: 15
  - Valor: 1089 | Ocorrências: 14
  - Valor: 1024 | Ocorrências: 14
  - Valor: 1019 | Ocorrências: 14
  - Valor: 1012 | Ocorrências: 13
  - Valor: 1008 | Ocorrências: 13
  - Valor: 1051 | Ocorrências: 13
  - Valor: 1023 | Ocorrências: 13
  - Valor: 1096 | Ocorrências: 13
  - Valor: 1063 | Ocorrências: 13
  - Valor: 1016 | Ocorrências: 13
  - Valor: 1002 | Ocorrências: 13
  - Valor: 1036 | Ocorrências: 12
  - Valor: 1039 | Ocorrências: 12
  - Valor: 1047 | Ocorrências: 12
  - Valor: 1054 | Ocorrências: 12
  - Valor: 1061 | Ocorrências: 12
  - Valor: 1032 | Ocorrências: 12
  - Valor: 1052 | Ocorrências: 12
  - Valor: 1075 | Ocorrências: 12
  - Valor: 1069 | Ocorrências: 12
  - Valor: 1003 | Ocorrências: 12
  - Valor: 1004 | Ocorrências: 11
  - Valor: 1093 | Ocorrências: 11
  - Valor: 1005 | Ocorrências: 11
  - Valor: 1027 | Ocorrências: 11
  - Valor: 1048 | Ocorrências: 11
  - Valor: 1060 | Ocorrências: 11
  - Valor: 1053 | Ocorrências: 11
  - Valor: 1035 | Ocorrências: 10
  - Valor: 1028 | Ocorrências: 10
  - Valor: 1095 | Ocorrências: 10
  - Valor: 1074 | Ocorrências: 10
  - Valor: 1015 | Ocorrências: 10
  - Valor: 1025 | Ocorrências: 10
  - Valor: 1021 | Ocorrências: 10
  - Valor: 1067 | Ocorrências: 10
  - Valor: 1087 | Ocorrências: 10
  - Valor: 1013 | Ocorrências: 10
  - Valor: 1059 | Ocorrências: 10
  - Valor: 1030 | Ocorrências: 10
  - Valor: 1044 | Ocorrências: 10
  - Valor: 1038 | Ocorrências: 10
  - Valor: 1009 | Ocorrências: 10
  - Valor: 1014 | Ocorrências: 10
  - Valor: 1056 | Ocorrências: 9
  - Valor: 1045 | Ocorrências: 9
  - Valor: 1097 | Ocorrências: 9
  - Valor: 1057 | Ocorrências: 9
  - Valor: 1026 | Ocorrências: 9
  - Valor: 1050 | Ocorrências: 9
  - Valor: 1018 | Ocorrências: 9
  - Valor: 1088 | Ocorrências: 9
  - Valor: 1100 | Ocorrências: 9
  - Valor: 1034 | Ocorrências: 9
  - Valor: 1064 | Ocorrências: 9
  - Valor: 1049 | Ocorrências: 9
  - Valor: 1042 | Ocorrências: 9
  - Valor: 1085 | Ocorrências: 8
  - Valor: 1072 | Ocorrências: 8
  - Valor: 1076 | Ocorrências: 8
  - Valor: 1066 | Ocorrências: 8
  - Valor: 1080 | Ocorrências: 8
  - Valor: 1007 | Ocorrências: 8
  - Valor: 1094 | Ocorrências: 8
  - Valor: 1084 | Ocorrências: 8
  - Valor: 1029 | Ocorrências: 8
  - Valor: 1065 | Ocorrências: 8
  - Valor: 1006 | Ocorrências: 8
  - Valor: 1078 | Ocorrências: 8
  - Valor: 1037 | Ocorrências: 7
  - Valor: 1073 | Ocorrências: 7
  - Valor: 1046 | Ocorrências: 7
  - Valor: 1020 | Ocorrências: 7
  - Valor: 1098 | Ocorrências: 7
  - Valor: 1070 | Ocorrências: 7
  - Valor: 1081 | Ocorrências: 7
  - Valor: 1082 | Ocorrências: 7
  - Valor: 1055 | Ocorrências: 7
  - Valor: 1077 | Ocorrências: 7
  - Valor: 1071 | Ocorrências: 6
  - Valor: 1022 | Ocorrências: 6
  - Valor: 1079 | Ocorrências: 6
  - Valor: 1010 | Ocorrências: 6
  - Valor: 1091 | Ocorrências: 5
  - Valor: 1043 | Ocorrências: 5
  - Valor: 1068 | Ocorrências: 5
  - Valor: 1040 | Ocorrências: 5
  - Valor: 1011 | Ocorrências: 4
  - Valor: 1041 | Ocorrências: 4
  - Valor: 1083 | Ocorrências: 4
  - Valor: 1031 | Ocorrências: 3

Coluna: Sale_Date
Status: Possui 660 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 2023-11-14 | Ocorrências: 8
  - Valor: 2023-10-20 | Ocorrências: 8
  - Valor: 2023-10-15 | Ocorrências: 7
  - Valor: 2023-11-24 | Ocorrências: 7
  - Valor: 2023-01-12 | Ocorrências: 7
  - Valor: 2023-10-16 | Ocorrências: 7
  - Valor: 2023-08-14 | Ocorrências: 7
  - Valor: 2023-02-09 | Ocorrências: 6
  - Valor: 2023-01-17 | Ocorrências: 6
  - Valor: 2023-02-08 | Ocorrências: 6
  - Valor: 2023-08-15 | Ocorrências: 6
  - Valor: 2023-10-12 | Ocorrências: 6
  - Valor: 2023-01-25 | Ocorrências: 6
  - Valor: 2023-01-04 | Ocorrências: 6
  - Valor: 2023-08-03 | Ocorrências: 6
  - Valor: 2023-12-22 | Ocorrências: 6
  - Valor: 2023-02-28 | Ocorrências: 6
  - Valor: 2023-03-25 | Ocorrências: 6
  - Valor: 2023-11-15 | Ocorrências: 6
  - Valor: 2023-11-01 | Ocorrências: 6
  - Valor: 2023-04-14 | Ocorrências: 6
  - Valor: 2023-12-15 | Ocorrências: 6
  - Valor: 2023-08-24 | Ocorrências: 6
  - Valor: 2023-01-29 | Ocorrências: 6
  - Valor: 2023-11-16 | Ocorrências: 6
  - Valor: 2023-10-30 | Ocorrências: 5
  - Valor: 2023-01-09 | Ocorrências: 5
  - Valor: 2023-12-19 | Ocorrências: 5
  - Valor: 2023-11-20 | Ocorrências: 5
  - Valor: 2023-08-12 | Ocorrências: 5
  - Valor: 2023-04-02 | Ocorrências: 5
  - Valor: 2023-04-08 | Ocorrências: 5
  - Valor: 2023-02-07 | Ocorrências: 5
  - Valor: 2023-05-28 | Ocorrências: 5
  - Valor: 2023-06-10 | Ocorrências: 5
  - Valor: 2023-08-17 | Ocorrências: 5
  - Valor: 2023-01-11 | Ocorrências: 5
  - Valor: 2023-09-18 | Ocorrências: 5
  - Valor: 2023-10-29 | Ocorrências: 5
  - Valor: 2023-07-07 | Ocorrências: 5
  - Valor: 2023-12-25 | Ocorrências: 5
  - Valor: 2023-02-11 | Ocorrências: 5
  - Valor: 2023-01-07 | Ocorrências: 5
  - Valor: 2023-09-24 | Ocorrências: 5
  - Valor: 2023-09-21 | Ocorrências: 5
  - Valor: 2023-12-31 | Ocorrências: 5
  - Valor: 2023-11-05 | Ocorrências: 5
  - Valor: 2023-03-04 | Ocorrências: 5
  - Valor: 2023-06-06 | Ocorrências: 5
  - Valor: 2023-02-24 | Ocorrências: 5
  - Valor: 2023-11-26 | Ocorrências: 5
  - Valor: 2023-06-01 | Ocorrências: 5
  - Valor: 2023-04-27 | Ocorrências: 5
  - Valor: 2023-05-17 | Ocorrências: 5
  - Valor: 2023-06-03 | Ocorrências: 5
  - Valor: 2023-08-31 | Ocorrências: 5
  - Valor: 2023-04-21 | Ocorrências: 5
  - Valor: 2023-07-17 | Ocorrências: 5
  - Valor: 2023-08-11 | Ocorrências: 5
  - Valor: 2023-06-26 | Ocorrências: 5
  - Valor: 2023-11-09 | Ocorrências: 5
  - Valor: 2023-01-15 | Ocorrências: 5
  - Valor: 2023-06-02 | Ocorrências: 5
  - Valor: 2023-12-10 | Ocorrências: 5
  - Valor: 2023-05-14 | Ocorrências: 5
  - Valor: 2023-09-08 | Ocorrências: 5
  - Valor: 2023-10-23 | Ocorrências: 5
  - Valor: 2023-10-22 | Ocorrências: 4
  - Valor: 2023-06-28 | Ocorrências: 4
  - Valor: 2023-12-26 | Ocorrências: 4
  - Valor: 2023-05-11 | Ocorrências: 4
  - Valor: 2023-07-21 | Ocorrências: 4
  - Valor: 2023-09-14 | Ocorrências: 4
  - Valor: 2023-11-12 | Ocorrências: 4
  - Valor: 2023-08-25 | Ocorrências: 4
  - Valor: 2023-07-29 | Ocorrências: 4
  - Valor: 2023-06-15 | Ocorrências: 4
  - Valor: 2023-08-04 | Ocorrências: 4
  - Valor: 2023-03-30 | Ocorrências: 4
  - Valor: 2023-10-18 | Ocorrências: 4
  - Valor: 2023-08-10 | Ocorrências: 4
  - Valor: 2023-12-30 | Ocorrências: 4
  - Valor: 2023-06-07 | Ocorrências: 4
  - Valor: 2023-01-14 | Ocorrências: 4
  - Valor: 2023-03-23 | Ocorrências: 4
  - Valor: 2023-12-29 | Ocorrências: 4
  - Valor: 2023-03-13 | Ocorrências: 4
  - Valor: 2023-12-20 | Ocorrências: 4
  - Valor: 2023-03-16 | Ocorrências: 4
  - Valor: 2023-12-01 | Ocorrências: 4
  - Valor: 2023-04-28 | Ocorrências: 4
  - Valor: 2023-10-28 | Ocorrências: 4
  - Valor: 2023-03-03 | Ocorrências: 4
  - Valor: 2023-11-07 | Ocorrências: 4
  - Valor: 2023-04-05 | Ocorrências: 4
  - Valor: 2023-06-22 | Ocorrências: 4
  - Valor: 2023-11-06 | Ocorrências: 4
  - Valor: 2023-02-15 | Ocorrências: 4
  - Valor: 2023-01-20 | Ocorrências: 4
  - Valor: 2023-04-23 | Ocorrências: 4
  - Valor: 2023-02-16 | Ocorrências: 4
  - Valor: 2023-01-27 | Ocorrências: 4
  - Valor: 2023-10-09 | Ocorrências: 4
  - Valor: 2023-09-19 | Ocorrências: 4
  - Valor: 2023-04-11 | Ocorrências: 4
  - Valor: 2023-06-27 | Ocorrências: 4
  - Valor: 2023-04-30 | Ocorrências: 4
  - Valor: 2023-05-27 | Ocorrências: 4
  - Valor: 2023-05-10 | Ocorrências: 4
  - Valor: 2023-03-31 | Ocorrências: 4
  - Valor: 2023-02-06 | Ocorrências: 3
  - Valor: 2023-05-21 | Ocorrências: 3
  - Valor: 2023-01-22 | Ocorrências: 3
  - Valor: 2023-08-21 | Ocorrências: 3
  - Valor: 2023-07-01 | Ocorrências: 3
  - Valor: 2023-06-19 | Ocorrências: 3
  - Valor: 2023-05-29 | Ocorrências: 3
  - Valor: 2023-09-26 | Ocorrências: 3
  - Valor: 2023-10-01 | Ocorrências: 3
  - Valor: 2023-06-09 | Ocorrências: 3
  - Valor: 2023-01-03 | Ocorrências: 3
  - Valor: 2023-08-02 | Ocorrências: 3
  - Valor: 2023-07-18 | Ocorrências: 3
  - Valor: 2023-06-25 | Ocorrências: 3
  - Valor: 2023-03-28 | Ocorrências: 3
  - Valor: 2023-05-08 | Ocorrências: 3
  - Valor: 2023-07-20 | Ocorrências: 3
  - Valor: 2023-11-19 | Ocorrências: 3
  - Valor: 2023-09-23 | Ocorrências: 3
  - Valor: 2023-08-27 | Ocorrências: 3
  - Valor: 2023-04-06 | Ocorrências: 3
  - Valor: 2023-07-14 | Ocorrências: 3
  - Valor: 2023-03-22 | Ocorrências: 3
  - Valor: 2023-07-28 | Ocorrências: 3
  - Valor: 2023-06-24 | Ocorrências: 3
  - Valor: 2023-02-10 | Ocorrências: 3
  - Valor: 2023-04-18 | Ocorrências: 3
  - Valor: 2023-12-08 | Ocorrências: 3
  - Valor: 2023-05-02 | Ocorrências: 3
  - Valor: 2023-12-03 | Ocorrências: 3
  - Valor: 2023-07-12 | Ocorrências: 3
  - Valor: 2023-06-30 | Ocorrências: 3
  - Valor: 2023-09-07 | Ocorrências: 3
  - Valor: 2024-01-01 | Ocorrências: 3
  - Valor: 2023-03-02 | Ocorrências: 3
  - Valor: 2023-03-14 | Ocorrências: 3
  - Valor: 2023-02-03 | Ocorrências: 3
  - Valor: 2023-01-05 | Ocorrências: 3
  - Valor: 2023-05-03 | Ocorrências: 3
  - Valor: 2023-05-13 | Ocorrências: 3
  - Valor: 2023-09-27 | Ocorrências: 3
  - Valor: 2023-09-30 | Ocorrências: 3
  - Valor: 2023-01-26 | Ocorrências: 3
  - Valor: 2023-05-25 | Ocorrências: 3
  - Valor: 2023-05-23 | Ocorrências: 3
  - Valor: 2023-01-23 | Ocorrências: 3
  - Valor: 2023-03-10 | Ocorrências: 3
  - Valor: 2023-07-13 | Ocorrências: 3
  - Valor: 2023-05-30 | Ocorrências: 3
  - Valor: 2023-03-19 | Ocorrências: 3
  - Valor: 2023-03-17 | Ocorrências: 3
  - Valor: 2023-12-16 | Ocorrências: 3
  - Valor: 2023-09-04 | Ocorrências: 3
  - Valor: 2023-06-14 | Ocorrências: 3
  - Valor: 2023-03-01 | Ocorrências: 3
  - Valor: 2023-12-27 | Ocorrências: 3
  - Valor: 2023-03-27 | Ocorrências: 3
  - Valor: 2023-02-05 | Ocorrências: 3
  - Valor: 2023-06-17 | Ocorrências: 3
  - Valor: 2023-06-08 | Ocorrências: 3
  - Valor: 2023-08-16 | Ocorrências: 3
  - Valor: 2023-08-13 | Ocorrências: 3
  - Valor: 2023-01-01 | Ocorrências: 3
  - Valor: 2023-11-22 | Ocorrências: 3
  - Valor: 2023-11-28 | Ocorrências: 3
  - Valor: 2023-04-25 | Ocorrências: 3
  - Valor: 2023-12-28 | Ocorrências: 2
  - Valor: 2023-08-06 | Ocorrências: 2
  - Valor: 2023-03-21 | Ocorrências: 2
  - Valor: 2023-01-16 | Ocorrências: 2
  - Valor: 2023-08-08 | Ocorrências: 2
  - Valor: 2023-05-26 | Ocorrências: 2
  - Valor: 2023-05-22 | Ocorrências: 2
  - Valor: 2023-08-23 | Ocorrências: 2
  - Valor: 2023-11-18 | Ocorrências: 2
  - Valor: 2023-04-04 | Ocorrências: 2
  - Valor: 2023-08-07 | Ocorrências: 2
  - Valor: 2023-04-12 | Ocorrências: 2
  - Valor: 2023-09-25 | Ocorrências: 2
  - Valor: 2023-03-05 | Ocorrências: 2
  - Valor: 2023-08-05 | Ocorrências: 2
  - Valor: 2023-10-02 | Ocorrências: 2
  - Valor: 2023-11-03 | Ocorrências: 2
  - Valor: 2023-11-08 | Ocorrências: 2
  - Valor: 2023-07-06 | Ocorrências: 2
  - Valor: 2023-06-13 | Ocorrências: 2
  - Valor: 2023-10-27 | Ocorrências: 2
  - Valor: 2023-12-12 | Ocorrências: 2
  - Valor: 2023-01-31 | Ocorrências: 2
  - Valor: 2023-03-20 | Ocorrências: 2
  - Valor: 2023-01-06 | Ocorrências: 2
  - Valor: 2023-06-12 | Ocorrências: 2
  - Valor: 2023-12-18 | Ocorrências: 2
  - Valor: 2023-08-30 | Ocorrências: 2
  - Valor: 2023-07-11 | Ocorrências: 2
  - Valor: 2023-07-23 | Ocorrências: 2
  - Valor: 2023-02-27 | Ocorrências: 2
  - Valor: 2023-04-13 | Ocorrências: 2
  - Valor: 2023-09-28 | Ocorrências: 2
  - Valor: 2023-07-27 | Ocorrências: 2
  - Valor: 2023-04-03 | Ocorrências: 2
  - Valor: 2023-06-23 | Ocorrências: 2
  - Valor: 2023-02-19 | Ocorrências: 2
  - Valor: 2023-01-24 | Ocorrências: 2
  - Valor: 2023-03-18 | Ocorrências: 2
  - Valor: 2023-07-25 | Ocorrências: 2
  - Valor: 2023-11-10 | Ocorrências: 2
  - Valor: 2023-06-04 | Ocorrências: 2
  - Valor: 2023-02-14 | Ocorrências: 2
  - Valor: 2023-06-29 | Ocorrências: 2
  - Valor: 2023-04-15 | Ocorrências: 2
  - Valor: 2023-12-23 | Ocorrências: 2
  - Valor: 2023-11-11 | Ocorrências: 2
  - Valor: 2023-12-04 | Ocorrências: 2
  - Valor: 2023-04-09 | Ocorrências: 2
  - Valor: 2023-08-29 | Ocorrências: 2
  - Valor: 2023-10-04 | Ocorrências: 2
  - Valor: 2023-12-06 | Ocorrências: 2
  - Valor: 2023-04-22 | Ocorrências: 2
  - Valor: 2023-09-03 | Ocorrências: 2
  - Valor: 2023-07-02 | Ocorrências: 2
  - Valor: 2023-10-05 | Ocorrências: 2
  - Valor: 2023-05-20 | Ocorrências: 2
  - Valor: 2023-10-14 | Ocorrências: 2
  - Valor: 2023-07-15 | Ocorrências: 2
  - Valor: 2023-03-29 | Ocorrências: 2
  - Valor: 2023-02-20 | Ocorrências: 2
  - Valor: 2023-12-05 | Ocorrências: 2
  - Valor: 2023-10-19 | Ocorrências: 2
  - Valor: 2023-09-06 | Ocorrências: 2
  - Valor: 2023-02-23 | Ocorrências: 2
  - Valor: 2023-10-08 | Ocorrências: 2
  - Valor: 2023-01-08 | Ocorrências: 2
  - Valor: 2023-10-24 | Ocorrências: 2
  - Valor: 2023-09-11 | Ocorrências: 2
  - Valor: 2023-06-11 | Ocorrências: 2
  - Valor: 2023-02-04 | Ocorrências: 2
  - Valor: 2023-10-13 | Ocorrências: 2
  - Valor: 2023-08-01 | Ocorrências: 2
  - Valor: 2023-04-24 | Ocorrências: 2
  - Valor: 2023-12-13 | Ocorrências: 2
  - Valor: 2023-07-30 | Ocorrências: 2
  - Valor: 2023-10-21 | Ocorrências: 2
  - Valor: 2023-02-01 | Ocorrências: 2
  - Valor: 2023-11-25 | Ocorrências: 2
  - Valor: 2023-09-01 | Ocorrências: 2
  - Valor: 2023-04-29 | Ocorrências: 2
  - Valor: 2023-01-10 | Ocorrências: 2
  - Valor: 2023-10-07 | Ocorrências: 2
  - Valor: 2023-02-18 | Ocorrências: 2
  - Valor: 2023-05-12 | Ocorrências: 2
  - Valor: 2023-04-07 | Ocorrências: 2
  - Valor: 2023-07-19 | Ocorrências: 2
  - Valor: 2023-06-21 | Ocorrências: 2
  - Valor: 2023-09-16 | Ocorrências: 2
  - Valor: 2023-11-29 | Ocorrências: 2
  - Valor: 2023-06-20 | Ocorrências: 2
  - Valor: 2023-05-07 | Ocorrências: 2
  - Valor: 2023-01-02 | Ocorrências: 2
  - Valor: 2023-01-13 | Ocorrências: 2
  - Valor: 2023-11-17 | Ocorrências: 2
  - Valor: 2023-04-16 | Ocorrências: 2
  - Valor: 2023-03-08 | Ocorrências: 2

Coluna: Sales_Rep
Status: Possui 995 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: David | Ocorrências: 222
  - Valor: Eve | Ocorrências: 209
  - Valor: Bob | Ocorrências: 208
  - Valor: Alice | Ocorrências: 192
  - Valor: Charlie | Ocorrências: 169

Coluna: Region
Status: Possui 996 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: North | Ocorrências: 267
  - Valor: East | Ocorrências: 263
  - Valor: West | Ocorrências: 244
  - Valor: South | Ocorrências: 226

Coluna: Sales_Amount
Status: Possui 2 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 7946.69 | Ocorrências: 2
  - Valor: 6116.75 | Ocorrências: 2

Coluna: Quantity_Sold
Status: Possui 951 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 47 | Ocorrências: 32
  - Valor: 45 | Ocorrências: 28
  - Valor: 17 | Ocorrências: 28
  - Valor: 42 | Ocorrências: 26
  - Valor: 32 | Ocorrências: 26
  - Valor: 35 | Ocorrências: 26
  - Valor: 23 | Ocorrências: 25
  - Valor: 43 | Ocorrências: 25
  - Valor: 16 | Ocorrências: 25
  - Valor: 12 | Ocorrências: 24
  - Valor: 4 | Ocorrências: 24
  - Valor: 14 | Ocorrências: 23
  - Valor: 26 | Ocorrências: 22
  - Valor: 11 | Ocorrências: 22
  - Valor: 20 | Ocorrências: 22
  - Valor: 28 | Ocorrências: 22
  - Valor: 19 | Ocorrências: 22
  - Valor: 40 | Ocorrências: 22
  - Valor: 2 | Ocorrências: 21
  - Valor: 25 | Ocorrências: 21
  - Valor: 22 | Ocorrências: 21
  - Valor: 46 | Ocorrências: 21
  - Valor: 31 | Ocorrências: 21
  - Valor: 13 | Ocorrências: 20
  - Valor: 9 | Ocorrências: 20
  - Valor: 48 | Ocorrências: 20
  - Valor: 6 | Ocorrências: 20
  - Valor: 39 | Ocorrências: 19
  - Valor: 38 | Ocorrências: 19
  - Valor: 44 | Ocorrências: 19
  - Valor: 21 | Ocorrências: 19
  - Valor: 1 | Ocorrências: 19
  - Valor: 15 | Ocorrências: 19
  - Valor: 27 | Ocorrências: 18
  - Valor: 8 | Ocorrências: 18
  - Valor: 29 | Ocorrências: 18
  - Valor: 36 | Ocorrências: 18
  - Valor: 30 | Ocorrências: 18
  - Valor: 5 | Ocorrências: 18
  - Valor: 24 | Ocorrências: 17
  - Valor: 18 | Ocorrências: 16
  - Valor: 34 | Ocorrências: 16
  - Valor: 49 | Ocorrências: 16
  - Valor: 37 | Ocorrências: 15
  - Valor: 3 | Ocorrências: 15
  - Valor: 10 | Ocorrências: 15
  - Valor: 7 | Ocorrências: 15
  - Valor: 33 | Ocorrências: 13
  - Valor: 41 | Ocorrências: 11

Coluna: Product_Category
Status: Possui 996 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: Clothing | Ocorrências: 268
  - Valor: Furniture | Ocorrências: 260
  - Valor: Electronics | Ocorrências: 246
  - Valor: Food | Ocorrências: 226

Coluna: Unit_Cost
Status: Possui 2 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 3351.33 | Ocorrências: 2
  - Valor: 666.84 | Ocorrências: 2

Coluna: Unit_Price
Status: Não possui valores duplicados

Coluna: Customer_Type
Status: Possui 998 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: New | Ocorrências: 504
  - Valor: Returning | Ocorrências: 496

Coluna: Discount
Status: Possui 969 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: 0.22 | Ocorrências: 44
  - Valor: 0.17 | Ocorrências: 42
  - Valor: 0.24 | Ocorrências: 42
  - Valor: 0.25 | Ocorrências: 40
  - Valor: 0.2 | Ocorrências: 39
  - Valor: 0.21 | Ocorrências: 39
  - Valor: 0.12 | Ocorrências: 39
  - Valor: 0.03 | Ocorrências: 39
  - Valor: 0.09 | Ocorrências: 38
  - Valor: 0.04 | Ocorrências: 38
  - Valor: 0.27 | Ocorrências: 37
  - Valor: 0.1 | Ocorrências: 37
  - Valor: 0.01 | Ocorrências: 37
  - Valor: 0.26 | Ocorrências: 33
  - Valor: 0.07 | Ocorrências: 33
  - Valor: 0.29 | Ocorrências: 33
  - Valor: 0.06 | Ocorrências: 31
  - Valor: 0.13 | Ocorrências: 31
  - Valor: 0.14 | Ocorrências: 31
  - Valor: 0.08 | Ocorrências: 31
  - Valor: 0.15 | Ocorrências: 29
  - Valor: 0.23 | Ocorrências: 28
  - Valor: 0.18 | Ocorrências: 28
  - Valor: 0.28 | Ocorrências: 27
  - Valor: 0.19 | Ocorrências: 27
  - Valor: 0.05 | Ocorrências: 26
  - Valor: 0.02 | Ocorrências: 24
  - Valor: 0.11 | Ocorrências: 22
  - Valor: 0.16 | Ocorrências: 21
  - Valor: 0.3 | Ocorrências: 18
  - Valor: 0.0 | Ocorrências: 16

Coluna: Payment_Method
Status: Possui 997 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: Credit Card | Ocorrências: 345
  - Valor: Bank Transfer | Ocorrências: 342
  - Valor: Cash | Ocorrências: 313

Coluna: Sales_Channel
Status: Possui 998 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: Retail | Ocorrências: 512
  - Valor: Online | Ocorrências: 488

Coluna: Region_and_Sales_Rep
Status: Possui 980 valores duplicados
Valores duplicados e suas ocorrências:
  - Valor: North-Eve | Ocorrências: 64
  - Valor: East-Bob | Ocorrências: 60
  - Valor: East-David | Ocorrências: 59
  - Valor: South-David | Ocorrências: 56
  - Valor: North-David | Ocorrências: 56
  - Valor: North-Charlie | Ocorrências: 55
  - Valor: East-Eve | Ocorrências: 55
  - Valor: West-Bob | Ocorrências: 54
  - Valor: East-Alice | Ocorrências: 52
  - Valor: West-David | Ocorrências: 51
  - Valor: South-Bob | Ocorrências: 50
  - Valor: North-Alice | Ocorrências: 48
  - Valor: West-Alice | Ocorrências: 47
  - Valor: West-Eve | Ocorrências: 47
  - Valor: West-Charlie | Ocorrências: 45
  - Valor: South-Alice | Ocorrências: 45
  - Valor: North-Bob | Ocorrências: 44
  - Valor: South-Eve | Ocorrências: 43
  - Valor: East-Charlie | Ocorrências: 37
  - Valor: South-Charlie | Ocorrências: 32

### Remoção de espaços

In [6]:
def remover_espacos(df):
    """
    Remove espaços em branco à esquerda e à direita das strings em todas as colunas e nos nomes das colunas.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser processado.
    
    Retorna:
    - pandas.DataFrame: DataFrame com os espaços removidos.
    - pandas.DataFrame: DataFrame com informações sobre as remoções realizadas.
    """
    # Verificar se o DataFrame é válido
    if not isinstance(df, pd.DataFrame):
        raise ValueError("O argumento fornecido não é um DataFrame.")
    
    # Verificar espaços nos nomes das colunas antes
    colunas_com_espacos = [col for col in df.columns if col != col.strip()]
    espacos_colunas_antes = len(colunas_com_espacos)
    
    # Remover espaços dos nomes das colunas
    df.columns = df.columns.str.strip()
            
    # Inicializar lista para armazenar informações sobre remoções
    informacoes_remocoes = []

    # Adicionar informação sobre limpeza dos nomes das colunas
    informacoes_remocoes.append({
        'Coluna': 'NOMES DAS COLUNAS',
        'Espaços Antes': espacos_colunas_antes,
        'Espaços Depois': 0,
        'Remoção Bem-Sucedida': True
    })

    # Aplicar strip em todas as colunas de tipo object e category
    for col in df.select_dtypes(include=['object', 'category']).columns:
        # Contar espaços em branco antes da remoção
        espacos_antes = df[col].apply(lambda x: x != x.strip() if isinstance(x, str) else False).sum()
        
        # Remover espaços em branco
        df[col] = df[col].map(lambda x: x.strip() if isinstance(x, str) else x)
        
        # Contar espaços em branco após a remoção
        espacos_depois = df[col].apply(lambda x: x != x.strip() if isinstance(x, str) else False).sum()
        
        # Verificar se a remoção foi bem-sucedida
        sucesso = espacos_depois == 0
        
        # Adicionar informações à lista
        informacoes_remocoes.append({
            'Coluna': col,
            'Espaços Antes': espacos_antes,
            'Espaços Depois': espacos_depois,
            'Remoção Bem-Sucedida': sucesso
        })
    
    # Criar DataFrame com as informações de remoção
    df_informacoes_remocoes = pd.DataFrame(informacoes_remocoes)
    
    return df, df_informacoes_remocoes

# Exemplo de uso:
dados, informacoes_remocoes = remover_espacos(dados)

# Exibir as informações sobre as remoções
print("Informações sobre a remoção de espaços em branco:")
display(informacoes_remocoes)

Informações sobre a remoção de espaços em branco:

                 Coluna  Espaços Antes  Espaços Depois  Remoção Bem-Sucedida
0     NOMES DAS COLUNAS              0               0                  True
1             Sale_Date              0               0                  True
2             Sales_Rep              0               0                  True
3                Region              0               0                  True
4      Product_Category              0               0                  True
5         Customer_Type              0               0                  True
6        Payment_Method              0               0                  True
7         Sales_Channel              0               0                  True
8  Region_and_Sales_Rep              0               0                  True

### Verificação tipo dos dados

In [8]:
# Função para verificar o tipo dos dados/colunas
def verificar_tipo_dados(df):
    """
    Verifica o tipo dos dados/colunas de um DataFrame.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser verificado.
    
    Retorna:
    - pandas.DataFrame: DataFrame com os nomes das colunas e seus respectivos tipos de dados.
    """
    # Obter os tipos de dados das colunas
    tipos_dados = df.dtypes
    
    # Criar um DataFrame com os resultados
    tabela_tipos = pd.DataFrame({
        'Coluna': tipos_dados.index,
        'Tipo de Dado': tipos_dados.values
    })
    
    return tabela_tipos

# Verificar o tipo dos dados/colunas
tabela_tipos = verificar_tipo_dados(dados)
tabela_tipos

                  Coluna Tipo de Dado
0             Product_ID        int64
1              Sale_Date       object
2              Sales_Rep       object
3                 Region       object
4           Sales_Amount      float64
5          Quantity_Sold        int64
6       Product_Category       object
7              Unit_Cost      float64
8             Unit_Price      float64
9          Customer_Type       object
10              Discount      float64
11        Payment_Method       object
12         Sales_Channel       object
13  Region_and_Sales_Rep       object

### Valores máx/min

In [9]:
def valores_max_min(df):
    """
    Percorre todas as colunas numéricas (int ou float) de um DataFrame e retorna uma tabela com os valores máximos e mínimos de cada coluna.

    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser analisado.

    Retorna:
    - pandas.DataFrame: DataFrame com os valores máximos e mínimos de cada coluna numérica.
    """
    # Selecionar apenas colunas numéricas
    colunas_numericas = df.select_dtypes(include=['int64', 'float64']).columns
    
    # Criar listas para armazenar os resultados
    colunas = []
    valores_min = []
    valores_max = []
    
    # Percorrer cada coluna numérica e calcular os valores máximo e mínimo
    for coluna in colunas_numericas:
        colunas.append(coluna)
        valores_min.append(df[coluna].min())
        valores_max.append(df[coluna].max())
    
    # Criar o DataFrame final com todos os resultados de uma vez
    tabela_max_min = pd.DataFrame({
        'Coluna': colunas,
        'Valor Mínimo': valores_min,
        'Valor Máximo': valores_max
    })
    
    return tabela_max_min

# Aplicar a função e exibir a tabela de valores máximos e mínimos
tabela_max_min = valores_max_min(dados)
tabela_max_min

          Coluna  Valor Mínimo  Valor Máximo
0     Product_ID       1001.00       1100.00
1   Sales_Amount        100.12       9989.04
2  Quantity_Sold          1.00         49.00
3      Unit_Cost         60.28       4995.30
4     Unit_Price        167.12       5442.15
5       Discount          0.00          0.30

### Conversão otimização

In [10]:
def modificar_tipo_colunas(df, colunas_tipos):
    """
    Modifica o tipo de dado de colunas específicas em um DataFrame.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame original.
    - colunas_tipos (dict): Dicionário onde as chaves são os nomes das colunas e os valores são os tipos de dados desejados.
    
    Retorna:
    - pandas.DataFrame: DataFrame com os tipos de dados modificados.
    """
    # Verifica se as colunas informadas existem no DataFrame
    colunas_invalidas = [col for col in colunas_tipos.keys() if col not in df.columns]
    if colunas_invalidas:
        raise ValueError(f"Colunas inválidas: {colunas_invalidas}")
    
    # Modifica o tipo de dado das colunas especificadas
    for coluna, tipo in colunas_tipos.items():
        try:
            df[coluna] = df[coluna].astype(tipo)
            print(f"✅ Coluna '{coluna}' convertida para '{tipo}' com sucesso.")
        except Exception as e:
            print(f"⚠️ Erro ao converter a coluna '{coluna}' para '{tipo}': {e}")
    
    return df

# Exemplo de uso:
colunas_tipos = {
       # Colunas numéricas
    'Product_ID': 'int32',
    'Sales_Amount': 'float32',
    'Quantity_Sold': 'int8',
    'Unit_Cost': 'float32',
    'Unit_Price': 'float32',
    'Discount': 'float16',
    
    # Colunas categóricas
    'Region': 'category',
    'Product_Category': 'category',
    'Customer_Type': 'category',
    'Payment_Method': 'category',
    'Sales_Channel': 'category',
    
    # Data
    'Sale_Date': 'datetime64[ns]'
  
}
 

dados = modificar_tipo_colunas(dados, colunas_tipos)
dados.dtypes # Verificar os tipos de dados

✅ Coluna 'Product_ID' convertida para 'int32' com sucesso.
✅ Coluna 'Sales_Amount' convertida para 'float32' com sucesso.
✅ Coluna 'Quantity_Sold' convertida para 'int8' com sucesso.
✅ Coluna 'Unit_Cost' convertida para 'float32' com sucesso.
✅ Coluna 'Unit_Price' convertida para 'float32' com sucesso.
✅ Coluna 'Discount' convertida para 'float16' com sucesso.
✅ Coluna 'Region' convertida para 'category' com sucesso.
✅ Coluna 'Product_Category' convertida para 'category' com sucesso.
✅ Coluna 'Customer_Type' convertida para 'category' com sucesso.
✅ Coluna 'Payment_Method' convertida para 'category' com sucesso.
✅ Coluna 'Sales_Channel' convertida para 'category' com sucesso.
✅ Coluna 'Sale_Date' convertida para 'datetime64[ns]' com sucesso.

Product_ID                       int32
Sale_Date               datetime64[ns]
Sales_Rep                       object
Region                        category
Sales_Amount                   float32
Quantity_Sold                     int8
Product_Category              category
Unit_Cost                      float32
Unit_Price                     float32
Customer_Type                 category
Discount                       float16
Payment_Method                category
Sales_Channel                 category
Region_and_Sales_Rep            object
dtype: object

### Valores únicos

In [12]:
def detectar_valores_unicos(df, coluna):
    """
    Detecta valores únicos em uma coluna de um DataFrame e exibe esses valores de forma amigável.

    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser analisado.
    - coluna (str): Nome da coluna cujos valores únicos serão detectados.

    Retorna:
    - pandas.DataFrame: DataFrame com os valores únicos e suas contagens.
    - str: Mensagem indicando o sucesso da operação e o número de valores únicos encontrados.
    """
    if coluna not in df.columns:
        raise ValueError(f"Coluna '{coluna}' não encontrada no DataFrame.")
    
    # Detectar valores únicos e suas contagens
    valores_unicos = df[coluna].value_counts().reset_index()
    valores_unicos.columns = [coluna, 'Contagem']
    
    # Criar a mensagem de saída
    mensagem = f"Operação bem-sucedida! Foram encontrados {valores_unicos.shape[0]} valores únicos na coluna '{coluna}'."
    
    return valores_unicos, mensagem

# Exemplo de uso:
colunas = [
    'Product_ID', 'Sale_Date', 'Sales_Rep',
    'Region', 'Sales_Amount', 'Quantity_Sold',
    'Product_Category', 'Unit_Cost', 'Unit_Price',
    'Customer_Type', 'Discount', 'Payment_Method',
    'Sales_Channel', 'Region_and_Sales_Rep']

for coluna in colunas:
    valores_unicos, mensagem = detectar_valores_unicos(dados, coluna)
    # Exibir a mensagem e a tabela de valores únicos
    print(mensagem)
    display(valores_unicos)

Operação bem-sucedida! Foram encontrados 100 valores únicos na coluna 'Product_ID'.

    Product_ID  Contagem
0         1090        20
1         1062        19
2         1092        19
3         1099        18
4         1033        18
..         ...       ...
95        1040         5
96        1011         4
97        1041         4
98        1083         4
99        1031         3

[100 rows x 2 columns]

Operação bem-sucedida! Foram encontrados 340 valores únicos na coluna 'Sale_Date'.

     Sale_Date  Contagem
0   2023-11-14         8
1   2023-10-20         8
2   2023-10-15         7
3   2023-11-24         7
4   2023-01-12         7
..         ...       ...
335 2023-05-24         1
336 2023-11-27         1
337 2023-01-19         1
338 2023-01-18         1
339 2023-07-26         1

[340 rows x 2 columns]

Operação bem-sucedida! Foram encontrados 5 valores únicos na coluna 'Sales_Rep'.

  Sales_Rep  Contagem
0     David       222
1       Eve       209
2       Bob       208
3     Alice       192
4   Charlie       169

Operação bem-sucedida! Foram encontrados 4 valores únicos na coluna 'Region'.

  Region  Contagem
0  North       267
1   East       263
2   West       244
3  South       226

Operação bem-sucedida! Foram encontrados 998 valores únicos na coluna 'Sales_Amount'.

     Sales_Amount  Contagem
0     7946.689941         2
1     6116.750000         2
2     5053.970215         1
3     2279.100098         1
4     3788.080078         1
..            ...       ...
993   9673.650391         1
994    611.520020         1
995   5097.479980         1
996   7212.689941         1
997   4923.930176         1

[998 rows x 2 columns]

Operação bem-sucedida! Foram encontrados 49 valores únicos na coluna 'Quantity_Sold'.

    Quantity_Sold  Contagem
0              47        32
1              45        28
2              17        28
3              42        26
4              32        26
5              35        26
6              23        25
7              43        25
8              16        25
9              12        24
10              4        24
11             14        23
12             26        22
13             11        22
14             20        22
15             28        22
16             19        22
17             40        22
18              2        21
19             25        21
20             22        21
21             46        21
22             31        21
23             13        20
24              9        20
25             48        20
26              6        20
27             39        19
28             38        19
29             44        19
30             21        19
31              1        19
32             15        19
33             27        18
34              8        18
35             29        18
36             36        18
37             30        18
38              5        18
39             24        17
40             18        16
41             34        16
42             49        16
43             37        15
44              3        15
45             10        15
46              7        15
47             33        13
48             41        11

Operação bem-sucedida! Foram encontrados 4 valores únicos na coluna 'Product_Category'.

  Product_Category  Contagem
0         Clothing       268
1        Furniture       260
2      Electronics       246
3             Food       226

Operação bem-sucedida! Foram encontrados 998 valores únicos na coluna 'Unit_Cost'.

       Unit_Cost  Contagem
0    3351.330078         2
1     666.840027         2
2     152.750000         1
3     955.179993         1
4    4364.350098         1
..           ...       ...
993  2000.750000         1
994  4262.209961         1
995  1762.000000         1
996   224.320007         1
997  2632.580078         1

[998 rows x 2 columns]

Operação bem-sucedida! Foram encontrados 1000 valores únicos na coluna 'Unit_Price'.

      Unit_Price  Contagem
0     267.220001         1
1    3596.639893         1
2    2611.939941         1
3    2598.399902         1
4    1994.010010         1
..           ...       ...
995  4533.310059         1
996  2002.949951         1
997   715.059998         1
998  4116.379883         1
999  2926.679932         1

[1000 rows x 2 columns]

Operação bem-sucedida! Foram encontrados 2 valores únicos na coluna 'Customer_Type'.

  Customer_Type  Contagem
0           New       504
1     Returning       496

Operação bem-sucedida! Foram encontrados 31 valores únicos na coluna 'Discount'.

    Discount  Contagem
0   0.219971        44
1   0.170044        42
2   0.239990        42
3   0.250000        40
4   0.199951        39
5   0.209961        39
6   0.119995        39
7   0.029999        39
8   0.090027        38
9   0.040009        38
10  0.270020        37
11  0.099976        37
12  0.010002        37
13  0.260010        33
14  0.070007        33
15  0.290039        33
16  0.059998        31
17  0.130005        31
18  0.140015        31
19  0.080017        31
20  0.150024        29
21  0.229980        28
22  0.180054        28
23  0.280029        27
24  0.189941        27
25  0.049988        26
26  0.020004        24
27  0.109985        22
28  0.160034        21
29  0.300049        18
30  0.000000        16

Operação bem-sucedida! Foram encontrados 3 valores únicos na coluna 'Payment_Method'.

  Payment_Method  Contagem
0    Credit Card       345
1  Bank Transfer       342
2           Cash       313

Operação bem-sucedida! Foram encontrados 2 valores únicos na coluna 'Sales_Channel'.

  Sales_Channel  Contagem
0        Retail       512
1        Online       488

Operação bem-sucedida! Foram encontrados 20 valores únicos na coluna 'Region_and_Sales_Rep'.

   Region_and_Sales_Rep  Contagem
0             North-Eve        64
1              East-Bob        60
2            East-David        59
3           South-David        56
4           North-David        56
5         North-Charlie        55
6              East-Eve        55
7              West-Bob        54
8            East-Alice        52
9            West-David        51
10            South-Bob        50
11          North-Alice        48
12           West-Alice        47
13             West-Eve        47
14         West-Charlie        45
15          South-Alice        45
16            North-Bob        44
17            South-Eve        43
18         East-Charlie        37
19        South-Charlie        32

### Carga

In [13]:
def salvar_dados(df, caminho_arquivo_saida):
    """
    Salva o DataFrame em um arquivo CSV.
    
    Parâmetros:
    - df (pandas.DataFrame): DataFrame a ser salvo.
    - caminho_arquivo_saida (str): Caminho do arquivo CSV de saída.
    """
    df.to_csv(caminho_arquivo_saida, index=False)
    print(f"✅ Dados salvos com sucesso em '{caminho_arquivo_saida}'")

# Exemplo de uso:
caminho_arquivo_saida = '../data/processed/sales_data_atualizado.csv'
salvar_dados(dados, caminho_arquivo_saida)

✅ Dados salvos com sucesso em '../data/processed/sales_data_atualizado.csv'